_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ФормированиеДокументовЗаявкаНаРасходованиеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_ФормированиеДокументовЗаявкаНаРасходованиеДС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ГрафикДвиженийПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ГрафикДвиженийПоДоговору</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФинансированиеПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФинансированиеФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокДоходовРасходовПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокДоходовРасходовФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетДавальцу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытияПоДоговору</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыКлиентом</v8:Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ПорядокДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвозИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОплатыКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыКлиентом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансДоОбеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаДоОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитПослеОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСОERP_ГарантийноеУдержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСдвиг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОплатыПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансДоПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаДоПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитПослеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСОERP_ГарантийноеУдержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСдвиг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СпособыПланированияОплатыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыПланированияОплатыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВВалютеПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВВалютеВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныеБаллы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ФормированиеДокументовЗаявкаНаРасходованиеДС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура 	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодФормирования.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
   
	ЗаполнитьАналитикаДвиженияПоДоговору(ПериодФормирования.ДатаНачала, ПериодФормирования.ДатаОкончания, ОбъектСтроительства);
	
КонецПроцедуры

&НаКлиенте
Процедура 	ПериодФормированияПриИзменении(Элемент)															
	ЗаполнитьАналитикаДвиженияПоДоговору(ПериодФормирования.ДатаНачала, ПериодФормирования.ДатаОкончания, ОбъектСтроительства);
КонецПроцедуры

&НаКлиенте
Процедура 	ЗаявкиНаРасходованиеДСЗаявкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)			
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура 	Обновить(Команда)																				
	ЗаполнитьАналитикаДвиженияПоДоговору(ПериодФормирования.ДатаНачала, ПериодФормирования.ДатаОкончания, ОбъектСтроительства);
КонецПроцедуры

&НаКлиенте
Процедура 	ОбъектСтроительстваПриИзменении(Элемент)														
	ЗаполнитьАналитикаДвиженияПоДоговору(ПериодФормирования.ДатаНачала, ПериодФормирования.ДатаОкончания, ОбъектСтроительства);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиЗаполненияФормы

&НаСервере
Процедура 	ЗаполнитьАналитикаДвиженияПоДоговору(ДатаНачала, ДатаОкончания, ОбъектСтроительства)			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               	|	ГрафикДвиженийПоДоговору.Договор КАК Договор,
	               	|	ГрафикДвиженийПоДоговору.Контрагент КАК Контрагент,
	               	|	ГрафикДвиженийПоДоговору.ФинансированиеПланПриход КАК СуммаПлан,
	               	|	0 КАК СуммаФакт
	               	|ПОМЕСТИТЬ ДвиженияПоДоговору
	               	|ИЗ
	               	|	РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору.ОстаткиИОбороты(
	               	|			&ДатаНачала,
	               	|			&ДатаОкончания,
	               	|			Регистратор,
	               	|			,
	               	|			(Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	               	|				ИЛИ Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком))
	               	|				И ПорядокОплаты В (ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.КредитПослеПоступления), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание))
	               	|				И ОбъектСтроительства = &ОбъектСтроительства) КАК ГрафикДвиженийПоДоговору
	               	|ГДЕ
	               	|	(ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_ГрафикДвиженийПоДоговору
	               	|			ИЛИ ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_ДоговорССубподрядчиком)
	               	|
	               	|ОБЪЕДИНИТЬ ВСЕ
	               	|
	               	|ВЫБРАТЬ
	               	|	ГрафикДвиженийПоДоговору.Договор,
	               	|	ГрафикДвиженийПоДоговору.Контрагент,
	               	|	0,
	               	|	ГрафикДвиженийПоДоговору.ФинансированиеПланРасход
	               	|ИЗ
	               	|	РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору.ОстаткиИОбороты(
	               	|			&ДатаНачала,
	               	|			&ДатаОкончания,
	               	|			Регистратор,
	               	|			,
	               	|			(Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	               	|				ИЛИ Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком))
	               	|				И ПорядокОплаты В (ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.КредитПослеПоступления), ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание))
	               	|				И ОбъектСтроительства = &ОбъектСтроительства) КАК ГрафикДвиженийПоДоговору
	               	|ГДЕ
	               	|	(ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_РаспределениеПоАналитикеГрафикаДоговоров
	               	|			ИЛИ ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.УСОERP_ДоговорССубподрядчиком
	               	|			ИЛИ ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	               	|			ИЛИ ГрафикДвиженийПоДоговору.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств)
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	ДвиженияПоДоговору.Договор КАК Договор,
	               	|	ДвиженияПоДоговору.Контрагент КАК Контрагент,
	               	|	СУММА(ДвиженияПоДоговору.СуммаПлан) КАК СуммаПлан,
	               	|	СУММА(ДвиженияПоДоговору.СуммаФакт) КАК СуммаФакт
	               	|ИЗ
	               	|	ДвиженияПоДоговору КАК ДвиженияПоДоговору
	               	|
	               	|СГРУППИРОВАТЬ ПО
	               	|	ДвиженияПоДоговору.Договор,
	               	|	ДвиженияПоДоговору.Контрагент";
		
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Запрос.УстановитьПараметр("ДатаНачала", 			ДатаНачала);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаНачала", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("ДатаОкончания", 			ДатаОкончания);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаОкончания", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		Запрос.УстановитьПараметр("ОбъектСтроительства",	ОбъектСтроительства);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОбъектСтроительства = &ОбъектСтроительства", "");
	КонецЕсли;
		
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
	
	АналитикаДвиженияПоДоговору.Загрузить(ТЗ_Результат);	
	
КонецПроцедуры

&НаКлиенте
Процедура 	ПровестиВсе(Команда)																			
	
	ПровестиВсеНаСервере();

КонецПроцедуры

&НаСервере
Процедура 	ПровестиВсеНаСервере()																			
	
	Для Каждого ТекСтрока Из ЗаявкиНаРасходованиеДС Цикл
		Попытка
			ЗаявкаОбъект = ТекСтрока.Заявка.ПолучитьОбъект();
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось провести документ: " + ТекСтрока.Заявка, 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств);
									Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура 	СоздатьЗаявки(Команда)																			
	СоздатьЗаявкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура 	СоздатьЗаявкиНаСервере()																		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ_ДвиженияПоДоговору.Договор,
		|	ТЗ_ДвиженияПоДоговору.Контрагент
		|ПОМЕСТИТЬ ТЗ_ДвиженияПоДоговору
		|ИЗ
		|	&ТЗ_ДвиженияПоДоговору КАК ТЗ_ДвиженияПоДоговору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ_ДвиженияПоДоговору.Договор,
		|	ГрафикДвиженийПоДоговору.Ссылка КАК График,
		|	МАКСИМУМ(ГрафикДвиженийПоДоговору.Дата) КАК Дата
		|ПОМЕСТИТЬ ДанныеПоДоговору
		|ИЗ
		|	ТЗ_ДвиженияПоДоговору КАК ТЗ_ДвиженияПоДоговору
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_ГрафикДвиженийПоДоговору КАК ГрафикДвиженийПоДоговору
		|		ПО ТЗ_ДвиженияПоДоговору.Договор = ГрафикДвиженийПоДоговору.Договор
		|ГДЕ
		|	НЕ ГрафикДвиженийПоДоговору.ПометкаУдаления
		|	И ГрафикДвиженийПоДоговору.Дата >= &ДатаНачала И ГрафикДвиженийПоДоговору.Дата <= &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ_ДвиженияПоДоговору.Договор,
		|	ГрафикДвиженийПоДоговору.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ТЗ_ДвиженияПоДоговору.Контрагент,
		|	ДанныеПоДоговору.График
		|ПОМЕСТИТЬ ДанныеЗаявки
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ_ДвиженияПоДоговору КАК ТЗ_ДвиженияПоДоговору
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоДоговору КАК ДанныеПоДоговору
		|			ПО ТЗ_ДвиженияПоДоговору.Договор = ДанныеПоДоговору.Договор
		|		ПО ДоговорыКонтрагентов.Ссылка = ТЗ_ДвиженияПоДоговору.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеЗаявки.Договор,
		|	ДанныеЗаявки.Контрагент,
		|	ДанныеЗаявки.График,
		|	ГрафикДвиженийПоДоговоруОбороты.ДатаСобытияПоДоговору КАК ДатаПлатежа,
		|	ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты,
		|	ГрафикДвиженийПоДоговоруОбороты.ФинансированиеПланОборот КАК СуммаДокумента
		|ПОМЕСТИТЬ ДанныеРегистра
		|ИЗ
		|	ДанныеЗаявки КАК ДанныеЗаявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Регистратор,
		|				ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.КредитПослеПоступления)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание)) КАК ГрафикДвиженийПоДоговоруОбороты
		|		ПО ДанныеЗаявки.График = ГрафикДвиженийПоДоговоруОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистра.Договор,
		|	ДанныеРегистра.Контрагент,
		|	ДанныеРегистра.График,
		|	ДанныеРегистра.ДатаПлатежа,
		|	ДанныеРегистра.ПорядокОплаты,
		|	ДанныеРегистра.СуммаДокумента,
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Заявка
		|ИЗ
		|	ДанныеРегистра КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|		ПО ДанныеРегистра.Контрагент = ЗаявкаНаРасходованиеДенежныхСредств.Контрагент
		|			И ДанныеРегистра.Договор = ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование
		|			И (НЕ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления)
		|			И ДанныеРегистра.СуммаДокумента = ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента
		|			И ДанныеРегистра.ДатаПлатежа = ЗаявкаНаРасходованиеДенежныхСредств.ЖелательнаяДатаПлатежа
		|			И ДанныеРегистра.Договор.Организация = ЗаявкаНаРасходованиеДенежныхСредств.Организация
		|			И ДанныеРегистра.Договор.Подразделение = ЗаявкаНаРасходованиеДенежныхСредств.Подразделение";
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ_ДвиженияПоДоговору.Договор КАК Договор,
		|	ТЗ_ДвиженияПоДоговору.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ТЗ_ДвиженияПоДоговору
		|ИЗ
		|	&ТЗ_ДвиженияПоДоговору КАК ТЗ_ДвиженияПоДоговору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ_ДвиженияПоДоговору.Договор КАК Договор,
		|	ГрафикДвиженийПоДоговору.Ссылка КАК График,
		|	МАКСИМУМ(ГрафикДвиженийПоДоговору.Дата) КАК Дата
		|ПОМЕСТИТЬ ДанныеПоДоговору
		|ИЗ
		|	ТЗ_ДвиженияПоДоговору КАК ТЗ_ДвиженияПоДоговору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ГрафикДвиженийПоДоговору КАК ГрафикДвиженийПоДоговору
		|		ПО ТЗ_ДвиженияПоДоговору.Договор = ГрафикДвиженийПоДоговору.Договор
		|ГДЕ
		|	НЕ ГрафикДвиженийПоДоговору.ПометкаУдаления
		|	И ГрафикДвиженийПоДоговору.Дата >= &ДатаНачала
		|	И ГрафикДвиженийПоДоговору.Дата <= &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ_ДвиженияПоДоговору.Договор,
		|	ГрафикДвиженийПоДоговору.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЗ_ДвиженияПоДоговору.Договор,
		|	УСОERP_ДоговорСЗаказчиком.Ссылка,
		|	УСОERP_ДоговорСЗаказчиком.Дата
		|ИЗ
		|	ТЗ_ДвиженияПоДоговору КАК ТЗ_ДвиженияПоДоговору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ДоговорССубподрядчиком КАК УСОERP_ДоговорСЗаказчиком
		|		ПО ТЗ_ДвиженияПоДоговору.Договор = УСОERP_ДоговорСЗаказчиком.Договор
		|			И ТЗ_ДвиженияПоДоговору.Контрагент = УСОERP_ДоговорСЗаказчиком.Контрагент
		|ГДЕ
		|	УСОERP_ДоговорСЗаказчиком.Проведен
		|	И УСОERP_ДоговорСЗаказчиком.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ТЗ_ДвиженияПоДоговору.Контрагент КАК Контрагент,
		|	ДанныеПоДоговору.График КАК График
		|ПОМЕСТИТЬ ДанныеЗаявки
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ_ДвиженияПоДоговору КАК ТЗ_ДвиженияПоДоговору
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоДоговору КАК ДанныеПоДоговору
		|			ПО ТЗ_ДвиженияПоДоговору.Договор = ДанныеПоДоговору.Договор
		|		ПО ДоговорыКонтрагентов.Ссылка = ТЗ_ДвиженияПоДоговору.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеЗаявки.Договор КАК Договор,
		|	ДанныеЗаявки.Контрагент КАК Контрагент,
		|	ДанныеЗаявки.График КАК График,
		|	ГрафикДвиженийПоДоговоруОбороты.ДатаСобытияПоДоговору КАК ДатаПлатежа,
		|	ГрафикДвиженийПоДоговоруОбороты.ПорядокОплаты КАК ПорядокОплаты,
		|	ГрафикДвиженийПоДоговоруОбороты.ФинансированиеПланОборот КАК СуммаДокумента
		|ПОМЕСТИТЬ ДанныеРегистра
		|ИЗ
		|	ДанныеЗаявки КАК ДанныеЗаявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УСОERP_ГрафикДвиженийПоДоговору.Обороты(
		|				&ДатаНачала,
		|				&ДатаОкончания,
		|				Регистратор,
		|				ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.КредитПослеПоступления)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание)
		|					ИЛИ ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание)) КАК ГрафикДвиженийПоДоговоруОбороты
		|		ПО ДанныеЗаявки.График = ГрафикДвиженийПоДоговоруОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистра.Договор КАК Договор,
		|	ДанныеРегистра.Контрагент КАК Контрагент,
		|	ДанныеРегистра.График КАК График,
		|	ДанныеРегистра.ДатаПлатежа КАК ДатаПлатежа,
		|	ДанныеРегистра.ПорядокОплаты КАК ПорядокОплаты,
		|	ДанныеРегистра.СуммаДокумента КАК СуммаДокумента,
		|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Заявка
		|ИЗ
		|	ДанныеРегистра КАК ДанныеРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
		|		ПО ДанныеРегистра.Контрагент = ЗаявкаНаРасходованиеДенежныхСредств.Контрагент
		|			И ДанныеРегистра.Договор = ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование
		|			И (НЕ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления)
		|			И ДанныеРегистра.СуммаДокумента = ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента
		|			И ДанныеРегистра.ДатаПлатежа = ЗаявкаНаРасходованиеДенежныхСредств.ЖелательнаяДатаПлатежа
		|			И ДанныеРегистра.Договор.Организация = ЗаявкаНаРасходованиеДенежныхСредств.Организация
		|			И ДанныеРегистра.Договор.Подразделение = ЗаявкаНаРасходованиеДенежныхСредств.Подразделение";

		
	Запрос.УстановитьПараметр("ТЗ_ДвиженияПоДоговору", 	АналитикаДвиженияПоДоговору.Выгрузить());
	Если ЗначениеЗаполнено(ПериодФормирования.ДатаНачала) Тогда
		Запрос.УстановитьПараметр("ДатаНачала", 		ПериодФормирования.ДатаНачала);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ГрафикДвиженийПоДоговору.Дата >= &ДатаНачала", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаНачала", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(ПериодФормирования.ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("ДатаОкончания", 		ПериодФормирования.ДатаОкончания);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ГрафикДвиженийПоДоговору.Дата <= &ДатаОкончания", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаОкончания", "");
	КонецЕсли;

	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
		
	Для Каждого ТекСтрока Из ТЗ_Результат Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Заявка) Тогда
			
			НоваяЗаявка = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
			НоваяЗаявка.Дата 					= ТекущаяДата();               
			НоваяЗаявка.Контрагент 				= ТекСтрока.Контрагент;
			НоваяЗаявка.ДокументОснование 		= ТекСтрока.Договор;
			НоваяЗаявка.Организация 			= ТекСтрока.Договор.Организация;
			НоваяЗаявка.Подразделение 			= ТекСтрока.Договор.Подразделение;
			НоваяЗаявка.БанковскийСчет 			= ?(ЗначениеЗаполнено(ТекСтрока.Договор.БанковскийСчет),ТекСтрока.Договор.БанковскийСчет,Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ТекСтрока.Договор.Организация,ТекСтрока.Договор.ВалютаВзаиморасчетов));
			НоваяЗаявка.БанковскийСчетКонтрагента = ?(ЗначениеЗаполнено(ТекСтрока.Договор.БанковскийСчетКонтрагента),ТекСтрока.Договор.БанковскийСчетКонтрагента,Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(ТекСтрока.Контрагент,ТекСтрока.Договор.ВалютаВзаиморасчетов));;
			НоваяЗаявка.Статус					= Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована;
			НоваяЗаявка.КтоЗаявил				= ПараметрыСеанса.ТекущийПользователь;
			НоваяЗаявка.Валюта					= ТекСтрока.Договор.ВалютаВзаиморасчетов;
			НоваяЗаявка.ПланированиеСуммы 		= Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов;
			НоваяЗаявка.ФормаОплатыНаличная 	= Ложь;
			НоваяЗаявка.ФормаОплатыБезналичная 	= Истина;
			НоваяЗаявка.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ОплатаПоставщику; 		
			НоваяЗаявка.ПриоритетОплаты         = Справочники.ПриоритетыОплаты.НайтиПоНаименованию("Средний");
			НоваяЗаявка.ФормаОплатыЗаявки		= Перечисления.ФормыОплаты.Безналичная; 			
			НоваяЗаявка.ЖелательнаяДатаПлатежа	= ТекСтрока.ДатаПлатежа;
			НоваяЗаявка.СуммаДокумента			= ТекСтрока.СуммаДокумента;
			
			НоваяСтрокаЗаявки = НоваяЗаявка.РасшифровкаПлатежа.Добавить();
			НоваяСтрокаЗаявки.Заказ 						= ТекСтрока.Договор;
			НоваяСтрокаЗаявки.Партнер 						= ТекСтрока.Договор.Партнер;
			НоваяСтрокаЗаявки.СтатьяДвиженияДенежныхСредств = ?(ЗначениеЗаполнено(ТекСтрока.Договор.СтатьяДвиженияДенежныхСредств),ТекСтрока.Договор.СтатьяДвиженияДенежныхСредств,Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику);
			НоваяСтрокаЗаявки.Сумма							= ТекСтрока.СуммаДокумента;
			НоваяСтрокаЗаявки.СуммаВзаиморасчетов           = НоваяСтрокаЗаявки.Сумма;
			НоваяСтрокаЗаявки.СтавкаНДС = ?(ЗначениеЗаполнено(ТекСтрока.Договор.СтавкаНДС),ТекСтрока.Договор.СтавкаНДС,Перечисления.СтавкиНДС.БезНДС);
			НоваяСтрокаЗаявки.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(НоваяСтрокаЗаявки.Сумма,Истина,УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(НоваяСтрокаЗаявки.СтавкаНДС));
			НоваяСтрокаЗаявки.УСОERP_ОбъектСтроительства = ?(ЗначениеЗаполнено(ОбъектСтроительства),ОбъектСтроительства,Документы.УСОERP_ДополнительныеПараметрыПоДоговору.НайтиПоРеквизиту("Договор",ТекСтрока.Договор).ОбъектСтроительства);
			
			Попытка
				НоваяЗаявка.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка! Не удалось записать новую заявку на расходование ДС!", 
										УровеньЖурналаРегистрации.Ошибка, 
										Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств);
										Сообщить(ОписаниеОшибки());
			КонецПопытки;
			ТекСтрока.Заявка = НоваяЗаявка.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаявкиНаРасходованиеДС.Загрузить(ТЗ_Результат);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРасходованиеДСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ЗаявкиНаРасходованиеДС.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ПоказатьЗначение(,ТекСтрока.Заявка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
